# -*- coding: utf-8 -*-
"""
建檔日期：2020 10 16 Fri
@作者: Devin
@標題: 計算付款張數

說明:
貨幣的幣值有千元鈔,百元鈔,伍拾元硬幣,拾元硬幣與壹元硬幣,
根據金額可以換算出需要支付的貨幣個數

請設計一個程式,輸入一個金額,然後顯示需要支付的貨幣個數
"""

print("數字輸入與計算練習")
print("作者：Devin 2020.10.16")
print("---------------------")

m = int(input("請輸入金額"))

print("你輸入的金額是",m)
print("可以用以下方式支付")

# 計算千元鈔
c = m // 1000

# 計算百元鈔
d = (m - c*1000)//100

# 計算伍拾元幣
e = (m - c*1000 -d*100)//50

# 計算拾元幣
f = (m - c*1000 -d*100 -e*50)//10

# 計算壹元幣
g = m - c*1000 - d*100 - e*50 - f*10

print("千元鈔:", c)
print("百元鈔:", d)
print("伍拾元幣:",e)
print("拾元幣:",f)
print("壹元幣:",g)
